In [2]:
import pandas as pd
import numpy as np

In [3]:
data = [[8000, 1000], [9500, np.nan], [5000, 2000]]
df = pd.DataFrame(data, columns=['Salary', 'Others'])
df

   Salary  Others
0    8000  1000.0
1    9500     NaN
2    5000  2000.0

In [59]:
def subtract_federal_tax(df):
    return df * 0.9

def subtract_state_tax(df, rate):
    return df * (1 - rate)

def subtract_national_insurance(df, rate, rate_increase):
    new_rate = rate + rate_increase
    return df * (1 - new_rate)

def subtract_national_insurance_new(rate, df, rate_increase):
    new_rate = rate + rate_increase
    return df * (1 - new_rate)

#Individual Mode
federal  = subtract_federal_tax(df)
state    = subtract_state_tax(federal,0.12)
national = subtract_national_insurance(state,0.05,0.02)

In [63]:
#Combined Mode
subtract_national_insurance(
    subtract_state_tax(
        subtract_federal_tax(df),
        rate=0.12)
    ,rate=0.05
    ,rate_increase=0.02
)

    Salary   Others
0  5892.48   736.56
1  6997.32      NaN
2  3682.80  1473.12

In [64]:
#Using Pipe
(
df.pipe(subtract_federal_tax)
    .pipe(subtract_state_tax, rate=0.12)
    .pipe(subtract_national_insurance, rate=0.05, rate_increase=0.02)
)

    Salary   Others
0  5892.48   736.56
1  6997.32      NaN
2  3682.80  1473.12

In [65]:
#Function that take df as second Arg
(
    df.pipe(subtract_federal_tax)
    .pipe(subtract_state_tax, rate=0.12)
    .pipe(
        (subtract_national_insurance_new, 'df'),
        rate=0.05,
        rate_increase=0.02
    )
)

    Salary   Others
0  5892.48   736.56
1  6997.32      NaN
2  3682.80  1473.12